Dlubal.RFEM5.IScaffoldingHinge
Interface for working with scaffolding hinge

Dlubal.RFEM5.IScaffoldingHinge.GetInnerTube
Gets inner tube parameters.
Returns: Inner tube parameters

Dlubal.RFEM5.IScaffoldingHinge.SetInnerTube(System.UInt32@)
Sets inner tube parameters.
Diagram: Inner tube parameters

Dlubal.RFEM5.IScaffoldingHinge.GetOuterTube
Gets outer tube parameters.
Returns: Outer tube parameters

Dlubal.RFEM5.IScaffoldingHinge.SetOuterTube(System.UInt32@)
Sets outer tube parameters.
Diagram: Outer tube parameters